IDENTIFICATION DIVISION.
PROGRAM-ID. CALL2-1-1.

DATA DIVISION.
   LINKAGE SECTION.
   01 LS-VALUE-1 PIC 9(1).

PROCEDURE DIVISION USING LS-VALUE-1.
   DISPLAY LS-VALUE-1.
   ADD 1 TO LS-VALUE-1.
   DISPLAY LS-VALUE-1.
STOP RUN.