IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.


DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-COUNTER PIC S9(1) VALUES 0.
   
PROCEDURE DIVISION.

  Display "Hello-000"
  Perform 001-Para.
  STOP RUN.

  001-Para.
    Display "Hello-001".
