IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.


DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-COUNTER PIC S9(1) VALUES 0.
   
PROCEDURE DIVISION.

    Perform 
        display "Hello"
    end-perform.

STOP RUN.