IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUMBER-1 PIC 9(3) VALUE 50.
   01 WS-NUMBER-RESULT PIC 9(4) VALUE 100.

PROCEDURE DIVISION.
   SUBTRACT 5 5 WS-NUMBER-1 FROM WS-NUMBER-RESULT
   NOT ON SIZE ERROR DISPLAY "KEIN SPEICHERUEBERLAUF".
   DISPLAY WS-NUMBER-RESULT.
STOP RUN.
