IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUMBER-1 PIC 9(3) VALUE 50.
   01 WS-NUMBER-2 PIC 9(3) VALUE 100.
   01 WS-NUMBER-RESULT PIC 9(1) VALUE 1.

PROCEDURE DIVISION.
   SUBTRACT 5 5 WS-NUMBER-1 FROM WS-NUMBER-2 GIVING WS-NUMBER-RESULT
   ON SIZE ERROR DISPLAY "MIT SPEICHERUEBERLAUF".
   DISPLAY WS-NUMBER-2.
   DISPLAY WS-NUMBER-RESULT.
STOP RUN.
