IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-PERSON.
      02 FIRST-NAME     PIC A(10) VALUE 'Hans'.
      02 MIDDLE-NAME    PIC A(10) VALUE 'Dirk'.
      02 LAST-NAME      PIC A(10) VALUE 'Flaechsig'.
   01 WS-PERSON-REV.
      02 MIDDLE-NAME    PIC A(10).
      02 LAST-NAME      PIC A(10).
      02 FIRST-NAME     PIC A(10).

PROCEDURE DIVISION.
   MOVE CORR WS-PERSON TO WS-PERSON-REV.
   DISPLAY WS-PERSON.
   DISPLAY WS-PERSON-REV.
STOP RUN.
