IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUMBER-1 PIC A(3) VALUES 'ABC'.
   01 WS-NUMBER-2 PIC A(4).

PROCEDURE DIVISION.
   MOVE 'qwe' TO WS-NUMBER-1 WS-NUMBER-2
   DISPLAY WS-NUMBER-1
   DISPLAY WS-NUMBER-2
STOP RUN.