IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-INPUT PIC A(5) VALUE 'ASDFG'.
   01 WS-RESULT-1 PIC A(3) VALUES 'ABC'.
   01 WS-RESULT-2 PIC A(4).
   01 WS-RESULT-3 PIC A(6).

PROCEDURE DIVISION.
   MOVE WS-INPUT TO WS-RESULT-1 WS-RESULT-2 WS-RESULT-3
   DISPLAY WS-RESULT-1
   DISPLAY WS-RESULT-2
   DISPLAY WS-RESULT-3
STOP RUN.