IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUMBER-1 PIC 9(3) VALUES 50.
   01 WS-NUMBER-2 PIC 9(4)V9(2).

PROCEDURE DIVISION.
   MOVE 5.1 TO WS-NUMBER-1 WS-NUMBER-2
   DISPLAY WS-NUMBER-1
   DISPLAY WS-NUMBER-2
STOP RUN.