IDENTIFICATION DIVISION.
PROGRAM-ID. GOTO.

PROCEDURE DIVISION.
   PARA-A.
   DISPLAY 'IN PARA-A'
   GO TO PARA-C.

   PARA-B.
   DISPLAY 'IN PARA-B'.

   PARA-C.
   DISPLAY 'IN PARA-C'.
   GO TO PARA-F.

   PARA-D.
   DISPLAY 'IN PARA-D'.

   PARA-E.
   DISPLAY 'IN PARA-E'.

   PARA-F.
   DISPLAY 'IN PARA-F'.

   PARA-G.
   DISPLAY 'IN PARA-G'.

   STOP RUN.