IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUMBER-RESULT-1 PIC 9(2) VALUE 51.
   01 WS-NUMBER-RESULT-2 PIC 9(1) VALUE 9.

PROCEDURE DIVISION.
   divide 2 INTO 111 GIVING WS-NUMBER-RESULT-1 WS-NUMBER-RESULT-2
   ON SIZE ERROR DISPLAY "KEIN SPEICHERUEBERLAUF".
   DISPLAY WS-NUMBER-RESULT-1.
   DISPLAY WS-NUMBER-RESULT-2.
STOP RUN.
