IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.

PROCEDURE DIVISION.
  IF 1 IS POSITIVE
  THEN CONTINUE
  ELSE DISPLAY "FALSE-FALL".
STOP RUN.
