IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
   FILE-CONTROL.
   SELECT STUDENT ASSIGN TO 'test-output/write/write-1.txt'.

DATA DIVISION.
   FILE SECTION.
   FD STUDENT.
   01 STUDENT-FILE.
      05 STUDENT-ID PIC 9(5).
      05 NAME PIC A(25).
      05 CLASSNAME PIC X(3).

PROCEDURE DIVISION.
   OPEN OUTPUT STUDENT.
   MOVE 1000 TO STUDENT-ID.
   MOVE 'Tim' TO NAME.
   MOVE '10' TO CLASSNAME.
   WRITE STUDENT-FILE.	
   CLOSE STUDENT.
   
   OPEN INPUT STUDENT.
     READ STUDENT
         AT END DISPLAY 'End of Records'
         NOT AT END DISPLAY STUDENT-FILE
     END-READ
   CLOSE STUDENT.
STOP RUN.