IDENTIFICATION DIVISION. 
    PROGRAM-ID. HELLO-WORLD.
    
DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-RESULT PIC A(15).
  01 WS-POINTER PIC 9(2) VALUE 3.
  
PROCEDURE DIVISION.
	STRING 'HELLO' ' ' 'WORLD' DELIMITED SIZE 
	    INTO WS-RESULT
	    WITH POINTER WS-POINTER
	    ON OVERFLOW 
	        DISPLAY 'OVERFLOW ERROR'
	        DISPLAY 'SECOND LINE'
	    NOT ON OVERFLOW 
	        DISPLAY 'NO OVERFLOW ERROR'
	END-STRING.
    DISPLAY WS-RESULT.
    DISPLAY WS-POINTER.
    