IDENTIFICATION DIVISION. 
    PROGRAM-ID. HELLO-WORLD.
    
DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-RESULT PIC A(11).
  
PROCEDURE DIVISION.
	STRING 'HELLO' ' ' 'WORLD' DELIMITED SIZE 
	    INTO WS-RESULT
	    ON OVERFLOW 
	        DISPLAY 'OVERFLOW ERROR'
	        DISPLAY 'SECOND LINE'
	    NOT ON OVERFLOW 
	        DISPLAY 'NO OVERFLOW ERROR'
	        DISPLAY 'SECOND LINE (NO ERROR)'
	END-STRING.
    DISPLAY WS-RESULT.