IDENTIFICATION DIVISION. 
    PROGRAM-ID. HELLO-WORLD.
    
DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-RESULT PIC A(11).
  
PROCEDURE DIVISION.
	STRING 'HELLO' ' ' 'WORLD' DELIMITED SIZE INTO WS-RESULT.
    DISPLAY WS-RESULT.