IDENTIFICATION DIVISION. 
    PROGRAM-ID. HELLO-WORLD.
    
DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-QUELLE PIC X(17) VALUE '00001Max  Muster '.
  01 WS-SENKE.
     05 WS-NUMMER PIC A(5).
     05 WS-VORNAME PIC A(5).
     05 WS-NACHNAME PIC A(6).
     05 WS-POINTER PIC 9(2) VALUE 26.
  
PROCEDURE DIVISION.
  UNSTRING WS-QUELLE
    INTO WS-NUMMER 
         WS-VORNAME
         WS-NACHNAME
    ON OVERFLOW DISPLAY 'OVERFLOW'
    NOT ON OVERFLOW DISPLAY 'NO OVERFLOW'.
  DISPLAY WS-NUMMER.
  DISPLAY WS-VORNAME.
  DISPLAY WS-NACHNAME.
  DISPLAY WS-QUELLE '#'.
  STOP RUN.