IDENTIFICATION DIVISION. 
    PROGRAM-ID. HELLO-WORLD.
PROCEDURE DIVISION.
    001-Paragraph.
        Display "Hello".
    002-Paragraph.
        Display "World".
    Stop Run.