IDENTIFICATION DIVISION.
PROGRAM-ID. OCCURS-TEST.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-TEST PIC A(5) OCCURS 3.

PROCEDURE DIVISION.
MOVE 'A' to WS-TEST(1).
DISPLAY WS-TEST(1) '#'.
STOP RUN.