IDENTIFICATION DIVISION.
PROGRAM-ID. OCCURS-TEST.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-ARRAY.
     05 WS-HELLO PIC A(10) VALUE 'HELLO'.
     05 WS-TEST PIC A(5) OCCURS 3.
     05 WS-END PIC A(5) VALUE 'ENDE'.

PROCEDURE DIVISION.
MOVE 'A' to WS-TEST(1).
MOVE 'B' TO WS-TEST(2).
MOVE 'C' TO WS-TEST(3).
DISPLAY WS-ARRAY '#'.
STOP RUN.