IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-GROUP.
      02 ITEM-1 PIC A(10) Value 'Hello'.
      02 ITEM-2 PIC A(10) Value 'World'.

PROCEDURE DIVISION.
   DISPLAY WS-GROUP.
   DISPLAY ITEM-1.
   DISPLAY ITEM-2.
STOP RUN.