IDENTIFICATION DIVISION.
PROGRAM-ID. PERFTIMI.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-DATA-A	PIC X(20) VALUE 'MAINFRAMESTECHHELP'.
  01 WS-DATA-B	REDEFINES WS-DATA-A PIC X(20).
  
PROCEDURE DIVISION.
	DISPLAY 'ACTUAL DATA IN WS-DATA-A : ' WS-DATA-A.
	DISPLAY 'ACTUAL DATA IN WS-DATA-B : ' WS-DATA-B.
	
	MOVE 'THE MAINFRAMESTECHHELP' TO WS-DATA-B.
	
	DISPLAY 'ACTUAL DATA IN WS-DATA-A : ' WS-DATA-A.
	DISPLAY 'ACTUAL DATA IN WS-DATA-B : ' WS-DATA-B.
	
	STOP RUN.