IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-ID   PIC S9(10) VALUE -12345.
   01 WS-DESC PIC  A(10) VALUE "ID-NAME: ".

PROCEDURE DIVISION.
   DISPLAY WS-DESC WS-ID.
STOP RUN.