IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-WORLD   PIC A(5) VALUE 'WORLD'.

PROCEDURE DIVISION.
   DISPLAY "Hello " WS-WORLD.
STOP RUN.