IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
   
PROCEDURE DIVISION.
    if 1 < 2 THEN
      DISPLAY "True"
    ELSE
      DISPLAY "False"
    END-IF.

STOP RUN.