IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
   
PROCEDURE DIVISION.
    if 2 <= 1 THEN
        DISPLAY "TRUE"
    ELSE
      DISPLAY "False"
    END-IF
STOP RUN.