IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
   
PROCEDURE DIVISION.
    if 3 >= 2 THEN
        DISPLAY "TRUE"
    ELSE
      DISPLAY "False"
    END-IF
STOP RUN.