IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUMBER-1 PIC 9(3) VALUES 50.
   01 WS-NUMBER-2 PIC 9(3)V9(2) VALUES 100.50.
   01 WS-NUMBER-RESULT PIC 9(1) VALUES 3.
   01 WS-NUMBER-RESULT2 PIC 9(3) VALUES 3.

PROCEDURE DIVISION.
   ADD 5.4 WS-NUMBER-1 TO WS-NUMBER-RESULT ROUNDED WS-NUMBER-RESULT2 ROUNDED
   ON SIZE ERROR
    DISPLAY 'SizeError'.
   DISPLAY WS-NUMBER-RESULT
   DISPLAY WS-NUMBER-RESULT2
STOP RUN.