IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUMBER-RESULT PIC 9(2) VALUES 3. 

PROCEDURE DIVISION.
   ADD 4 5 TO 6.6 GIVING  WS-NUMBER-RESULT rounded
   DISPLAY WS-NUMBER-RESULT
STOP RUN.