IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUMBER-RESULT PIC 9(1) VALUES 3. 
   01 WS-NUMBER-RESULT2 PIC 9(3) VALUES 3.

PROCEDURE DIVISION.
   ADD 4 5 TO 6 GIVING  WS-NUMBER-RESULT2
   DISPLAY WS-NUMBER-RESULT2
STOP RUN.