IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-STUDENT-NAME PIC X(25).

PROCEDURE DIVISION.
   ACCEPT WS-STUDENT-NAME.
   DISPLAY "Name : " WS-STUDENT-NAME '#'.
STOP RUN.