IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-DATE PIC X(10).

PROCEDURE DIVISION.
   ACCEPT WS-DATE FROM DATE
   DISPLAY WS-DATE NO ADVANCING
STOP RUN.