IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT STUDENT ASSIGN TO 'src/test/resources/de/cobolj/statement/read/input.txt'.

DATA DIVISION.
   FILE SECTION.
   FD STUDENT.
   01 STUDENT-FILE.
      05 STUDENT-ID PIC 9(5).
      05 NAME PIC A(25).
      
   WORKING-STORAGE SECTION.
   01 WS-STUDENT.
      05 STUDENT-ID PIC 9(5).
      05 NAME PIC A(25).

PROCEDURE DIVISION.
    OPEN INPUT STUDENT.
        READ STUDENT
            AT END DISPLAY 'End of Records'
            NOT AT END DISPLAY STUDENT-FILE
        END-READ
    CLOSE STUDENT.
STOP RUN.
