IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.


DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-RESULT PIC S9(2).
   
PROCEDURE DIVISION.
    COMPUTE WS-RESULT = 2 + 3 * 4
    DISPLAY WS-RESULT

STOP RUN.