IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.


DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-RESULT1 PIC S9(2) VALUE 5.
   
PROCEDURE DIVISION.
    COMPUTE WS-RESULT1 = 50 + 49
    NOT ON SIZE ERROR Display "No Size Error".
    DISPLAY WS-RESULT1

STOP RUN.