IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.


DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-RESULT1 PIC S9(2) VALUE 0.
   
PROCEDURE DIVISION.
    COMPUTE WS-RESULT1 = 24 / (4 + 2)
    DISPLAY WS-RESULT1

STOP RUN.