IDENTIFICATION DIVISION. 
    PROGRAM-ID. HELLO-WORLD.
    
DATA DIVISION.
  LINKAGE SECTION.
  01 LS-VORNAME PIC A(10).
  01 LS-NACHNAME PIC X(10).
  01 LS-GEBURTSJAHR PIC 9(5).

PROCEDURE DIVISION USING LS-VORNAME LS-NACHNAME LS-GEBURTSJAHR.
    DISPLAY LS-VORNAME LS-NACHNAME LS-GEBURTSJAHR.
EXIT PROGRAM.