IDENTIFICATION DIVISION. 
    PROGRAM-ID. CALL-1.
    
DATA DIVISION.
  LINKAGE SECTION.

PROCEDURE DIVISION.
    DISPLAY 'Hello world!'.
EXIT PROGRAM.